In [48]:
import pandas as pd

# Read the TXT file
df_lung_cancer = pd.read_csv('United States and Puerto Rico Cancer Statistics, 1999-2020 Mortality.txt', delimiter='\t')  # Change delimiter to match your file

# Save as CSV
df_lung_cancer.to_csv('Lung_Cancer.csv', index=False)

In [49]:
import pandas as pd

# Read the dataset into a DataFrame
df_with_pollutants = pd.read_csv('PM2.5withpollutants.csv')

# Drop the 'fips' column
df_with_pollutants = df_with_pollutants.drop('fips', axis=1)

In [50]:
df_lung_cancer = df_lung_cancer.drop('Notes', axis=1)

In [51]:
df_lung_cancer.head()

,Cancer Sites,Cancer Sites Code,State,State Code,Year,Year Code,Deaths
0,Respiratory System,22010-22060,Alabama,1.0,1999.0,1999.0,2920.0
1,Respiratory System,22010-22060,Alabama,1.0,2000.0,2000.0,3064.0
2,Respiratory System,22010-22060,Alabama,1.0,2001.0,2001.0,2995.0
3,Respiratory System,22010-22060,Alabama,1.0,2002.0,2002.0,3067.0
4,Respiratory System,22010-22060,Alabama,1.0,2003.0,2003.0,3188.0

In [52]:
df_lung_cancer.shape

(1167, 7)

In [53]:
df_lung_cancer.nunique()

Cancer Sites            1
Cancer Sites Code       1
State                  51
State Code             51
Year                   22
Year Code              22
Deaths               1004
dtype: int64

In [54]:

# Drop the specified columns
columns_to_drop = ['Cancer Sites', 'Cancer Sites Code', 'State Code', 'Year Code']
df_lung_cancer = df_lung_cancer.drop(columns=columns_to_drop)

In [55]:
df_lung_cancer.dtypes

State      object
Year      float64
Deaths    float64
dtype: object

In [56]:
df_lung_cancer.isnull().sum()

State     45
Year      45
Deaths    45
dtype: int64

In [57]:

df_lung_cancer['Year'].unique()

array([1999., 2000., 2001., 2002., 2003., 2004., 2005., 2006., 2007.,
       2008., 2009., 2010., 2011., 2012., 2013., 2014., 2015., 2016.,
       2017., 2018., 2019., 2020.,   nan])

In [58]:

df_lung_cancer = df_lung_cancer.dropna(subset=['Year'])

In [59]:
df_lung_cancer.isnull().sum()

State     0
Year      0
Deaths    0
dtype: int64

In [60]:
# Convert the 'Year' column from float to int
df_lung_cancer['Year'] = df_lung_cancer['Year'].astype(int)

In [61]:
df_lung_cancer.head()

     State  Year  Deaths
0  Alabama  1999  2920.0
1  Alabama  2000  3064.0
2  Alabama  2001  2995.0
3  Alabama  2002  3067.0
4  Alabama  2003  3188.0

In [62]:
df_with_pollutants.shape

(248640, 6)

In [63]:
df_with_pollutants.head()

  pollutant  year  pred_wght state_abbr        lat        lon
0        co  2000   0.342283         AL  32.500383 -86.494186
1        co  2000   0.322647         AL  30.548923 -87.762466
2        co  2000   0.302642         AL  31.844037 -85.309929
3        co  2000   0.308587         AL  33.030918 -87.127655
4        co  2000   0.331939         AL  33.955246 -86.591402

In [64]:
# Drop 'lat' and 'lon' columns
df_with_pollutants = df_with_pollutants.drop(['lat', 'lon'], axis=1)

# Group by 'pollutant', 'year', and 'state', and calculate the average of 'pred_wght'
df_with_pollutants = df_with_pollutants.groupby(['pollutant', 'year', 'state_abbr']).mean().reset_index()

In [65]:
df_with_pollutants.shape

(3840, 4)

In [66]:
df_with_pollutants.head()

  pollutant  year state_abbr  pred_wght
0        co  2000         AL   0.324396
1        co  2000         AR   0.327984
2        co  2000         AZ   0.422265
3        co  2000         CA   0.462393
4        co  2000         CO   0.383861

In [67]:
df_with_pollutants['pollutant'].unique()

array(['co', 'no2', 'o3', 'pm25', 'so2'], dtype=object)

In [68]:
# Pivot the DataFrame to have pollutants as columns
df_with_pollutants = df_with_pollutants.pivot(index=['year', 'state_abbr'], columns='pollutant', values='pred_wght').reset_index()

# Rename the columns
df_with_pollutants.columns.name = None

# Fill any NaN values with 0 if needed
df_with_pollutants = df_with_pollutants.fillna(0)

In [69]:
df_with_pollutants.head()

   year state_abbr        co        no2         o3       pm25       so2
0  2000         AL  0.324396   5.983593  57.601273  15.064598  3.251818
1  2000         AR  0.327984   6.059882  53.942551  12.076962  2.859271
2  2000         AZ  0.422265   9.915901  58.282240   7.400383  2.343078
3  2000         CA  0.462393  10.756098  48.635815  10.896779  1.930857
4  2000         CO  0.383861   8.429847  59.836639   5.501561  2.511782

In [70]:
print(df_lung_cancer.shape,df_with_pollutants.shape)

(1122, 3) (768, 7)

In [71]:
# Create a dictionary to map state abbreviations to state names
state_mapping = {
    'AL': 'Alabama',
    'AK': 'Alaska',
    'AZ': 'Arizona',
    'AR': 'Arkansas',
    'CA': 'California',
    'CO': 'Colorado',
    'CT': 'Connecticut',
    'DE': 'Delaware',
    'DC': 'District of Columbia',
    'FL': 'Florida',
    'GA': 'Georgia',
    'HI': 'Hawaii',
    'ID': 'Idaho',
    'IL': 'Illinois',
    'IN': 'Indiana',
    'IA': 'Iowa',
    'KS': 'Kansas',
    'KY': 'Kentucky',
    'LA': 'Louisiana',
    'ME': 'Maine',
    'MD': 'Maryland',
    'MA': 'Massachusetts',
    'MI': 'Michigan',
    'MN': 'Minnesota',
    'MS': 'Mississippi',
    'MO': 'Missouri',
    'MT': 'Montana',
    'NE': 'Nebraska',
    'NV': 'Nevada',
    'NH': 'New Hampshire',
    'NJ': 'New Jersey',
    'NM': 'New Mexico',
    'NY': 'New York',
    'NC': 'North Carolina',
    'ND': 'North Dakota',
    'OH': 'Ohio',
    'OK': 'Oklahoma',
    'OR': 'Oregon',
    'PA': 'Pennsylvania',
    'RI': 'Rhode Island',
    'SC': 'South Carolina',
    'SD': 'South Dakota',
    'TN': 'Tennessee',
    'TX': 'Texas',
    'UT': 'Utah',
    'VT': 'Vermont',
    'VA': 'Virginia',
    'WA': 'Washington',
    'WV': 'West Virginia',
    'WI': 'Wisconsin',
    'WY': 'Wyoming',
    'AS': 'American Samoa',
    'GU': 'Guam',
    'MP': 'Northern Mariana Islands',
    'PR': 'Puerto Rico',
    'VI': 'Virgin Islands',
    'TT': 'Trust Territories'
}

# Replace 'state_abbr' with state names using the mapping
df_with_pollutants['state_abbr'] = df_with_pollutants['state_abbr'].map(state_mapping)

In [73]:
# Rename the 'state_abbr' column to 'State'
df_with_pollutants.rename(columns={'state_abbr': 'State'}, inplace=True)

In [74]:
df_with_pollutants.head()

   year       State        co        no2         o3       pm25       so2
0  2000     Alabama  0.324396   5.983593  57.601273  15.064598  3.251818
1  2000    Arkansas  0.327984   6.059882  53.942551  12.076962  2.859271
2  2000     Arizona  0.422265   9.915901  58.282240   7.400383  2.343078
3  2000  California  0.462393  10.756098  48.635815  10.896779  1.930857
4  2000    Colorado  0.383861   8.429847  59.836639   5.501561  2.511782

In [77]:
df_with_pollutants.rename(columns={'year': 'Year'},inplace=True)

In [79]:
# Merge the two datasets based on 'State' and 'Year'
merged_df = pd.merge(df_with_pollutants, df_lung_cancer, on=['State', 'Year'])

# Display the merged dataset
print(merged_df)

     Year          State        co        no2         o3       pm25       so2  \
0    2000        Alabama  0.324396   5.983593  57.601273  15.064598  3.251818
1    2000       Arkansas  0.327984   6.059882  53.942551  12.076962  2.859271
2    2000        Arizona  0.422265   9.915901  58.282240   7.400383  2.343078
3    2000     California  0.462393  10.756098  48.635815  10.896779  1.930857
4    2000       Colorado  0.383861   8.429847  59.836639   5.501561  2.511782
..    ...            ...       ...        ...        ...        ...       ...
763  2015        Vermont  0.201841   3.520805  37.871561   5.399424  0.657656
764  2015     Washington  0.233047   4.182594  40.526978   6.219810  0.750324
765  2015      Wisconsin  0.209512   3.742194  41.926101   7.127667  1.029250
766  2015  West Virginia  0.239511   3.996316  44.032946   7.580497  1.365585
767  2015        Wyoming  0.245562   3.714728  48.860621   4.538552  1.198622

      Deaths
0     3064.0
1     2027.0
2     2574.0
3    14060.0
4     1463.0
..       ...
763    360.0
764   3184.0
765   2957.0
766   1549.0
767    219.0

[768 rows x 8 columns]

In [80]:
merged_df.head()

,Year,State,co,no2,o3,pm25,so2,Deaths
0,2000,Alabama,0.324396,5.983593,57.601273,15.064598,3.251818,3064.0
1,2000,Arkansas,0.327984,6.059882,53.942551,12.076962,2.859271,2027.0
2,2000,Arizona,0.422265,9.915901,58.282240,7.400383,2.343078,2574.0
3,2000,California,0.462393,10.756098,48.635815,10.896779,1.930857,14060.0
4,2000,Colorado,0.383861,8.429847,59.836639,5.501561,2.511782,1463.0

In [81]:
merged_df.shape

(768, 8)

In [83]:
merged_df.isnull().sum()

Year      0
State     0
co        0
no2       0
o3        0
pm25      0
so2       0
Deaths    0
dtype: int64

In [84]:
# Convert and save the merged_df to a CSV file
merged_df.to_csv('merged_dataset.csv', index=False)